tieutuanbao/mcu_xlibs/arch/8051/wch/ch552/inc/arm/reg_ch552.h
	/*  FlashROM and Data-Flash Registers  */
	sfr16 ROM_ADDR = 0x84;	 // address for flash-ROM, little-endian
	sfr ROM_ADDR_L = 0x84;	 // address low byte for flash-ROM
	sfr ROM_ADDR_H = 0x85;	 // address high byte for flash-ROM
	sfr16 ROM_DATA = 0x8E;	 // data for flash-ROM writing, little-endian
	sfr ROM_DATA_L = 0x8E;	 // data low byte for flash-ROM writing, data byte for Data-Flash reading/writing
	sfr ROM_DATA_H = 0x8F;	 // data high byte for flash-ROM writing
	sfr ROM_CTRL = 0x86;		 // WriteOnly: flash-ROM control
#define ROM_CMD_WRITE 0x9A // WriteOnly: flash-ROM word or Data-Flash byte write operation command
#define ROM_CMD_READ 0x8E	 // WriteOnly: Data-Flash byte read operation command
// sfr ROM_STATUS      = 0x86;         // ReadOnly: flash-ROM status
#define ROM_STATUS ROM_CTRL
#define bROM_ADDR_OK 0x40 // ReadOnly: flash-ROM writing operation address valid flag, can be reviewed before or after operation: 0=invalid parameter, 1=address valid
#define bROM_CMD_ERR 0x02 // ReadOnly: flash-ROM operation command error flag: 0=command accepted, 1=unknown command

	/*  Port Registers  */
	sfr P1 = 0x90;		 // port 1 input & output
	sbit P10 = P1^0; // P1.0
	sbit P11 = P1^1; // P1.1
	sbit P12 = P1^2; // P1.2
	sbit P13 = P1^3; // P1.3
	sbit P14 = P1^4; // P1.4
	sbit P15 = P1^5; // P1.5
	sbit P16 = P1^6; // P1.6
	sbit P17 = P1^7; // P1.7

	sbit SCK = P1^7;		// serial clock for SPI0
	sbit TXD1 = P1^7;		// TXD output for UART1
	sbit TIN5 = P1^7;		// TIN5 for Touch-Key
	sbit MISO = P1^6;		// master serial data input or slave serial data output for SPI0
	sbit RXD1 = P1^6;		// RXD input for UART1
	sbit TIN4 = P1^6;		// TIN4 for Touch-Key
	sbit MOSI = P1^5;		// master serial data output or slave serial data input for SPI0
	sbit PWM1 = P1^5;		// PWM output for PWM1
	sbit TIN3 = P1^5;		// TIN3 for Touch-Key
	sbit UCC2 = P1^5;		// CC2 for USB type-C
	sbit AIN2 = P1^5;		// AIN2 for ADC
	sbit T2_ = P1^4;		// alternate pin for T2
	sbit CAP1_ = P1^4;	// alternate pin for CAP1
	sbit SCS = P1^4;		// slave chip-selection input for SPI0
	sbit TIN2 = P1^4;		// TIN2 for Touch-Key
	sbit UCC1 = P1^4;		// CC1 for USB type-C
	sbit AIN1 = P1^4;		// AIN1 for ADC
	sbit TXD_ = P1^3;		// alternate pin for TXD of UART0
	sbit RXD_ = P1^2;		// alternate pin for RXD of UART0
	sbit T2EX = P1^1;		// external trigger input for timer2 reload & capture
	sbit CAP2 = P1^1;		// capture2 input for timer2
	sbit TIN1 = P1^1;		// TIN1 for Touch-Key
	sbit VBUS2 = P1^1;	// VBUS2 for USB type-C
	sbit AIN0 = P1^1;		// AIN0 for ADC
	sbit T2 = P1^0;			// external count input
	sbit CAP1 = P1^0;		// capture1 input for timer2
	sbit TIN0 = P1^0;		// TIN0 for Touch-Key
	sfr P1_MOD_OC = 0x92; // port 1 output mode: 0=push-pull, 1=open-drain
	sfr P1_DIR_PU = 0x93; // port 1 direction for push-pull or pullup enable for open-drain
// Pn_MOD_OC & Pn_DIR_PU: pin input & output configuration for Pn (n=1/3)
//   0 0:  float input only, without pullup resistance
//   0 1:  push-pull output, strong driving high level and low level
//   1 0:  open-drain output and input without pullup resistance
//   1 1:  quasi-bidirectional (standard 8051 mode), open-drain output and input with pullup resistance, just driving high level strongly for 2 clocks if turning output level from low to high
#define bSCK 0x80			// serial clock for SPI0
#define bTXD1 0x80		// TXD output for UART1
#define bMISO 0x40		// master serial data input or slave serial data output for SPI0
#define bRXD1 0x40		// RXD input for UART1
#define bMOSI 0x20		// master serial data output or slave serial data input for SPI0
#define bPWM1 0x20		// PWM output for PWM1
#define bUCC2 0x20		// CC2 for USB type-C
#define bAIN2 0x20		// AIN2 for ADC
#define bT2_ 0x10			// alternate pin for T2
#define bCAP1_ 0x10		// alternate pin for CAP1
#define bSCS 0x10			// slave chip-selection input for SPI0
#define bUCC1 0x10		// CC1 for USB type-C
#define bAIN1 0x10		// AIN1 for ADC
#define bTXD_ 0x08		// alternate pin for TXD of UART0
#define bRXD_ 0x04		// alternate pin for RXD of UART0
#define bT2EX 0x02		// external trigger input for timer2 reload & capture
#define bCAP2 bT2EX		// capture2 input for timer2
#define bVBUS2 0x02		// VBUS2 for USB type-C
#define bAIN0 0x02		// AIN0 for ADC
#define bT2 0x01			// external count input or clock output for timer2
#define bCAP1 bT2			// capture1 input for timer2
	sfr P2 = 0xA0;			// port 2
	sfr P3 = 0xB0;			// port 3 input & output
	sbit P3_0 = P3^0; // P3.0
	sbit P3_1 = P3^1; // P3.1
	sbit P3_2 = P3^2; // P3.2
	sbit P3_3 = P3^3; // P3.3
	sbit P3_4 = P3^4; // P3.4
	sbit P3_5 = P3^5; // P3.5
	sbit P3_6 = P3^6; // P3.6
	sbit P3_7 = P3^7; // P3.7

	sbit UDM = P3^7;				// ReadOnly: pin UDM input
	sbit UDP = P3^6;				// ReadOnly: pin UDP input
	sbit T1 = P3^5;					// external count input for timer1
	sbit PWM2 = P3^4;				// PWM output for PWM2
	sbit RXD1_ = P3^4;			// alternate pin for RXD1
	sbit T0 = P3^4;					// external count input for timer0
	sbit INT1 = P3^3;				// external interrupt 1 input
	sbit TXD1_ = P3^2;			// alternate pin for TXD1
	sbit INT0 = P3^2;				// external interrupt 0 input
	sbit VBUS1 = P3^2;			// VBUS1 for USB type-C
	sbit AIN3 = P3^2;				// AIN3 for ADC
	sbit PWM2_ = P3^1;			// alternate pin for PWM2
	sbit TXD = P3^1;				// TXD output for UART0
	sbit PWM1_ = P3^0;			// alternate pin for PWM1
	sbit RXD = P3^0;				// RXD input for UART0
	sfr P3_MOD_OC = 0x96;			// port 3 output mode: 0=push-pull, 1=open-drain
	sfr P3_DIR_PU = 0x97;			// port 3 direction for push-pull or pullup enable for open-drain
#define bUDM 0x80						// ReadOnly: pin UDM input
#define bUDP 0x40						// ReadOnly: pin UDP input
#define bT1 0x20						// external count input for timer1
#define bPWM2 0x10					// PWM output for PWM2
#define bRXD1_ 0x10					// alternate pin for RXD1
#define bT0 0x10						// external count input for timer0
#define bINT1 0x08					// external interrupt 1 input
#define bTXD1_ 0x04					// alternate pin for TXD1
#define bINT0 0x04					// external interrupt 0 input
#define bVBUS1 0x04					// VBUS1 for USB type-C
#define bAIN3 0x04					// AIN3 for ADC
#define bPWM2_ 0x02					// alternate pin for PWM2
#define bTXD 0x02						// TXD output for UART0
#define bPWM1_ 0x01					// alternate pin for PWM1
#define bRXD 0x01						// RXD input for UART0
	sfr PIN_FUNC = 0xC6;			// pin function selection
#define bUSB_IO_EN 0x80			// USB UDP/UDM I/O pin enable: 0=P3.6/P3.7 as GPIO, 1=P3.6/P3.7 as USB
#define bIO_INT_ACT 0x40		// ReadOnly: GPIO interrupt request action status
#define bUART1_PIN_X 0x20		// UART1 alternate pin enable: 0=RXD1/TXD1 on P1.6/P1.7, 1=RXD1/TXD1 on P3.4/P3.2
#define bUART0_PIN_X 0x10		// UART0 alternate pin enable: 0=RXD0/TXD0 on P3.0/P3.1, 1=RXD0/TXD0 on P1.2/P1.3
#define bPWM2_PIN_X 0x08		// PWM2 alternate pin enable: 0=PWM2 on P3.4, 1=PWM2 on P3.1
#define bPWM1_PIN_X 0x04		// PWM1 alternate pin enable: 0=PWM1 on P1.5, 1=PWM1 on P3.0
#define bT2EX_PIN_X 0x02		// T2EX/CAP2 alternate pin enable: 0=T2EX/CAP2 on P1.1, 1=T2EX/CAP2 on RST
#define bT2_PIN_X 0x01			// T2/CAP1 alternate pin enable: 0=T2/CAP1 on P1.1, 1=T2/CAP1 on P1.4
	sfr XBUS_AUX = 0xA2;			// xBUS auxiliary setting
#define bUART0_TX 0x80			// ReadOnly: indicate UART0 transmittal status
#define bUART0_RX 0x40			// ReadOnly: indicate UART0 receiving status
#define bSAFE_MOD_ACT 0x20	// ReadOnly: safe mode action status
#define GF2 0x08						// general purpose flag bit 2
#define bDPTR_AUTO_INC 0x04 // enable DPTR auto increase if finished MOVX_@DPTR instruction
#define DPS 0x01						// dual DPTR selection: 0=DPTR0 selected, 1=DPTR1 selected

	/*  Timer0/1 Registers  */
	sfr TCON = 0x88;			 // timer 0/1 control and external interrupt control
	sbit TF1 = TCON^7;	 // timer1 overflow & interrupt flag, auto cleared when MCU enter interrupt routine
	sbit TR1 = TCON^6;	 // timer1 run enable
	sbit TF0 = TCON^5;	 // timer0 overflow & interrupt flag, auto cleared when MCU enter interrupt routine
	sbit TR0 = TCON^4;	 // timer0 run enable
	sbit IE1 = TCON^3;	 // INT1 interrupt flag, auto cleared when MCU enter interrupt routine
	sbit IT1 = TCON^2;	 // INT1 interrupt type: 0=low level action, 1=falling edge action
	sbit IE0 = TCON^1;	 // INT0 interrupt flag, auto cleared when MCU enter interrupt routine
	sbit IT0 = TCON^0;	 // INT0 interrupt type: 0=low level action, 1=falling edge action
	sfr TMOD = 0x89;			 // timer 0/1 mode
#define bT1_GATE 0x80		 // gate control of timer1: 0=timer1 run enable while TR1=1, 1=timer1 run enable while P3.3 (INT1) pin is high and TR1=1
#define bT1_CT 0x40			 // counter or timer mode selection for timer1: 0=timer, use internal clock, 1=counter, use P3.5 (T1) pin falling edge as clock
#define bT1_M1 0x20			 // timer1 mode high bit
#define bT1_M0 0x10			 // timer1 mode low bit
#define MASK_T1_MOD 0x30 // bit mask of timer1 mode
// bT1_M1 & bT1_M0: timer1 mode
//   00: mode 0, 13-bit timer or counter by cascaded TH1 and lower 5 bits of TL1, the upper 3 bits of TL1 are ignored
//   01: mode 1, 16-bit timer or counter by cascaded TH1 and TL1
//   10: mode 2, TL1 operates as 8-bit timer or counter, and TH1 provide initial value for TL1 auto-reload
//   11: mode 3, stop timer1
#define bT0_GATE 0x08		 // gate control of timer0: 0=timer0 run enable while TR0=1, 1=timer0 run enable while P3.2 (INT0) pin is high and TR0=1
#define bT0_CT 0x04			 // counter or timer mode selection for timer0: 0=timer, use internal clock, 1=counter, use P3.4 (T0) pin falling edge as clock
#define bT0_M1 0x02			 // timer0 mode high bit
#define bT0_M0 0x01			 // timer0 mode low bit
#define MASK_T0_MOD 0x03 // bit mask of timer0 mode
	// bT0_M1 & bT0_M0: timer0 mode
	//   00: mode 0, 13-bit timer or counter by cascaded TH0 and lower 5 bits of TL0, the upper 3 bits of TL0 are ignored
	//   01: mode 1, 16-bit timer or counter by cascaded TH0 and TL0
	//   10: mode 2, TL0 operates as 8-bit timer or counter, and TH0 provide initial value for TL0 auto-reload
	//   11: mode 3, TL0 is 8-bit timer or counter controlled by standard timer0 bits, TH0 is 8-bit timer using TF1 and controlled by TR1, timer1 run enable if it is not mode 3
	sfr TL0 = 0x8A; // low byte of timer 0 count
	sfr TL1 = 0x8B; // low byte of timer 1 count
	sfr TH0 = 0x8C; // high byte of timer 0 count
	sfr TH1 = 0x8D; // high byte of timer 1 count

