tieutuanbao/mcu_xlibs/arch/8051/wch/ch552/inc/arm/reg_ch552.h
	/*----- XDATA: xRAM ------------------------------------------*/

#define XDATA_RAM_SIZE 0x0400 // size of expanded xRAM, xdata SRAM embedded chip

/*----- Reference Information --------------------------------------------*/
#define ID_CH552 0x52 // chip ID
#define ID_CH551 0x51 // chip ID

/* Interrupt routine address and interrupt number */
#define INT_ADDR_INT0 0x0003	// interrupt vector address for INT0
#define INT_ADDR_TMR0 0x000B	// interrupt vector address for timer0
#define INT_ADDR_INT1 0x0013	// interrupt vector address for INT1
#define INT_ADDR_TMR1 0x001B	// interrupt vector address for timer1
#define INT_ADDR_UART0 0x0023 // interrupt vector address for UART0
#define INT_ADDR_TMR2 0x002B	// interrupt vector address for timer2
#define INT_ADDR_SPI0 0x0033	// interrupt vector address for SPI0
#define INT_ADDR_TKEY 0x003B	// interrupt vector address for touch-key timer
#define INT_ADDR_USB 0x0043		// interrupt vector address for USB
#define INT_ADDR_ADC 0x004B		// interrupt vector address for ADC
#define INT_ADDR_UART1 0x0053 // interrupt vector address for UART1
#define INT_ADDR_PWMX 0x005B	// interrupt vector address for PWM1/2
#define INT_ADDR_GPIO 0x0063	// interrupt vector address for GPIO
#define INT_ADDR_WDOG 0x006B	// interrupt vector address for watch-dog timer
#define INT_NO_INT0 0					// interrupt number for INT0
#define INT_NO_TMR0 1					// interrupt number for timer0
#define INT_NO_INT1 2					// interrupt number for INT1
#define INT_NO_TMR1 3					// interrupt number for timer1
#define INT_NO_UART0 4				// interrupt number for UART0
#define INT_NO_TMR2 5					// interrupt number for timer2
#define INT_NO_SPI0 6					// interrupt number for SPI0
#define INT_NO_TKEY 7					// interrupt number for touch-key timer
#define INT_NO_USB 8					// interrupt number for USB
#define INT_NO_ADC 9					// interrupt number for ADC
#define INT_NO_UART1 10				// interrupt number for UART1
#define INT_NO_PWMX 11				// interrupt number for PWM1/2
#define INT_NO_GPIO 12				// interrupt number for GPIO
#define INT_NO_WDOG 13				// interrupt number for watch-dog timer

/* Special Program Space */
#define DATA_FLASH_ADDR 0xC000 // start address of Data-Flash
#define BOOT_LOAD_ADDR 0x3800	 // start address of boot loader program
#define ROM_CFG_ADDR 0x3FF8		 // chip configuration information address
#define ROM_CHIP_ID_HX 0x3FFA	 // chip ID number highest byte (only low byte valid)
#define ROM_CHIP_ID_LO 0x3FFC	 // chip ID number low word
#define ROM_CHIP_ID_HI 0x3FFE	 // chip ID number high word

	/*
	New Instruction:   MOVX @DPTR1,A
	Instruction Code:  0xA5
	Instruction Cycle: 1
	Instruction Operation:
		 step-1. write ACC @DPTR1 into xdata SRAM embedded chip
		 step-2. increase DPTR1
	ASM example:
				 INC  XBUS_AUX
				 MOV  DPTR,#TARGET_ADDR ;DPTR1
				 DEC  XBUS_AUX
				 MOV  DPTR,#SOURCE_ADDR ;DPTR0
				 MOV  R7,#xxH
	 LOOP: MOVX A,@DPTR ;DPTR0
				 INC  DPTR    ;DPTR0, if need
				 DB   0A5H    ;MOVX @DPTR1,A & INC DPTR1
				 DJNZ R7,LOOP
	*/

#ifdef __cplusplus
}
#endif

#endif // __REG_CH552_H